module.exports.config = {
    name: "war",
    version: "1.0.0",
    hasPermssion: 2,
    credits: "𝐏𝐫𝐢𝐲𝐚𝐧𝐬𝐡 𝐑𝐚𝐣𝐩𝐮𝐭",
    description: "War in group boxchat",
    commandCategory: "group",
    usages: "bold war",
    cooldowns: 10,
    dependencies: {
        "fs-extra": "",
        "axios": ""
    }
}

module.exports.run = async function({ api, args, Users, event}) {
 var mention = Object.keys(event.mentions)[0];
    
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("Listen to your father, kids !");
setTimeout(() => {a({body: "F*ck your mother" })}, 3000);
setTimeout(() => {a({body: "‎জং ধরা লোহা দিয়া পাকিস্তানের মানচিত্র বানাই্য়া তোদের পিছন দিয়া ঢুকামু।🤬  "})}, 5000);
setTimeout(() => {a({body: "‎তির ছেলে তোর বইনরে মুসলমানি দিমু।I lift my feet on my shoulder with you on the Hudding bridge🥵 " })}, 7000);
setTimeout(() => {a({body: "‎খাংকি মাগির পোলা কথা ক কম কম তর আম্মু রে চুদে বানামু আইটেম বোম  " })}, 9000);
setTimeout(() => {a({body: "‎খান্কি মাগির পোলা তর মায়ের ভোদা শিরিষ কাগজ দিয়া ঘইষা দিমু। 😇😇?" })}, 12000);
setTimeout(() => {a({body: "‎depression থেকেও তর মাইরে চু*** দি 🤬 " })}, 15000);
setTimeout(() => {a({body: "‎Welcome শুয়োরের বাচ্চা 🥰। " })}, 17000);
setTimeout(() => {a({body: "Hurry up and curse each other with me" })}, 20000);
setTimeout(() => {a({body: "Are the bad boys wrinkling their noses up to wage war on your father?" })}, 23000);
setTimeout(() => {a({body: "I fuck your mother" })}, 25000);
setTimeout(() => {a({body: "Delicious then yawn your mother up" })}, 28500);
setTimeout(() => {a({body: "Your father shot you to death by rapping" })}, 31000);
setTimeout(() => {a({body: "Please age eat me ?" })}, 36000);
setTimeout(() => {a({body: "If it's delicious, eat your dad" })}, 39000);
setTimeout(() => {a({body: "Before that, please give me a break for 1 minute" })}, 40000);
setTimeout(() => {a({body: "Please allow me to start" })}, 65000);
setTimeout(() => {a({body: "First of all, I would like to fuck you from top to bottom" })}, 70000);
setTimeout(() => {a({body: "I fuck from cunt hole to pussy cleavage" })}, 75000);
setTimeout(() => {a({body: "The cunt is as big as a buffalo's cunt masturbating a sewer pipe" })}, 80000);
setTimeout(() => {a({body: "‎বান্দি মাগির পোলা তর আম্মু রে চুদি তর দুলা ভাই এর কান্দে ফেলে  🤝 " })}, 85000);
setTimeout(() => {a("‎উফফফ খাদ্দামা মাগির পোলা তর আম্মুর কালা ভুদায় আমার মাল আউট তর কচি বোন রে উপ্তা করে এবার চুদবো  💉।খানকি মাগির পোলা তুর মারে চাইনা রেস্তোরাঁ নিয়ে জাইয়া রেসিপি লোভ দেখিয়ে চুদি তুই কি রাগ করবি 😅🤣💋🥵💋😹💋")} , 90000);
setTimeout(() => {a({body: "‎অনলাইনে গালি বাজ হয়ে গেছত মাগির পোলা এমন চুদা দিমু লাইফ টাইম মনে রাখভি ʀᴜᴘᴏᴋ তর বাপ মাগির ছেলে 😘।খাংকির পোলা তোর মা রে গাছ এর সাথে বেধে ভুদার মধ্যে তালগাছ ঢুকিয়ে চুদি🥵 " })}, 95000);
setTimeout(() => {a({body: "‎বাতিজা শুন তর আম্মু রে চুদলে রাগ করবি না তো আচ্ছা জা রাগ করিস না তর আম্মুর কালা ভুদায় আর চুদলাম না তো বোন এর জামা টা খুলে দে  ✋ খানকি মাগির পোলা তুর মারে চাইনা রেস্তোরাঁ নিয়ে জাইয়া রেসিপি লোভ দেখিয়ে চুদি তুই কি রাগ করবি 😅🤣💋🥵💋😹💋 " })}, 100000);
setTimeout(() => {a({body: "‎হিজলা মাগির পোলা বালি দিয়া চুদমু তরে খাঙ্কি মাগী!তর মাকে।  ✋" })}, 105000);
setTimeout(() => {a({body: "‎ভোদাই জানে চোদার মজা তোর মাকে জিজ্ঞেস কর কেমন দিছিলাম চোদা 🥰। নিশি রাতে তোর মাকে চুদে পেয়েছিলাম অনেক আনন্দ।🤩✊🏻 "})} , 115000);




  
}
